Repository: Luecx/SudokuSolver
Catalog: finnssudokusite/locale/*/LC_MESSAGES/djangojs.po
Languages: de

source: Enabled
de: Aktiviert

source: Optional: Cage Region
de: Optional: Käfigbereich

source: Optional: Numbers can repeat
de: Optional: Zahlen können sich wiederholen

source: Optional: Forbidden Sums (comma-sep)
de: Optional: Verbotene Summen (durch Komma getrennt)

source: 'sums' cannot be empty
de: 'Summen' darf nicht leer sein

source: “%(value)s” is not a valid number
de: „%(value)s“ ist keine gültige Zahl

source: Too many numbers: maximum allowed is 18
de: Zu viele Zahlen: maximal erlaubt sind 18

source: Invalid numbers: %(numbers)s
de: Ungültige Zahlen: %(numbers)s

source: Anti-Chess Sudoku
de: Anti-Schach Sudoku

source: Cells a knight's move away cannot contain the same digit.
de: Zellen, die eine Springerbewegung entfernt sind, dürfen dieselbe Zahl nicht enthalten.

source: Cells a king's move away cannot contain the same digit.
de: Zellen, die eine Königszug entfernt sind, dürfen dieselbe Zahl nicht enthalten.

source: Within defined cages:
de: Innerhalb definierter Käfige:

source: Digits within must not sum to the given value(s).
de: Die Zahlen innerhalb dürfen nicht die angegebenen Summe(n) ergeben.

source: The knight's and king's move restrictions apply.
de: Die Einschränkungen für Springer- und Königszüge gelten.

source: Knight's and king's cages can coexist.
de: Springer- und Königskäfige können gleichzeitig existieren.

source: Blue cages are knight's cages.
de: Blaue Käfige sind Springer-Käfige.

source: Green cages are king's cages.
de: Grüne Käfige sind König-Käfige.

source: If no cage is defined, the knight's and king's move restrictions apply to the entire board.
de: Wenn kein Käfig definiert ist, gelten die Springer- und Königszug-Einschränkungen für das gesamte Spielfeld.

source: knight's move
de: Springerzug

source: king's move
de: Königszug

source: within a specified region
de: innerhalb eines bestimmten Bereichs

source: anywhere on the board
de: über das gesamte Spielfeld

source: no two identical digits may be a %(piece)s apart %(scope)s
de: Keine zwei gleichen Ziffern dürfen %(piece)s auseinander sein %(scope)s

source: must not sum to %(sums)s
de: dürfen nicht die Summe %(sums)s ergeben

source: must be distinct
de: müssen verschieden sein

source: and digits
de: und Ziffern

source: and
de: und

source: no constraints are active.
de: Es sind keine Einschränkungen aktiv.

source: Arrow Base Cells
de: Pfeil-Basiszellen

source: Arrow Path Cells
de: Pfeil-Pfadzellen

source: Base and path cells overlap.
de: Basis- und Pfadzellen überschneiden sich.

source: Base cells are empty.
de: Basiszellen sind leer.

source: Path cells are empty.
de: Pfadzellen sind leer.

source: Base cells should be 1 or 2.
de: Basiszellen sollten 1 oder 2 sein.

source: Base cells must be adjacent and in the same row or column.
de: Basiszellen müssen benachbart und in derselben Reihe oder Spalte sein.

source: In an Arrow Sudoku, the digits along the path of the arrow sum to the digit in the circle at the base.
de: In einem Pfeil-Sudoku müssen die Ziffern entlang des Pfeilpfads die Zahl im Kreis an der Basis ergeben.

source: In an <b>Arrow Sudoku</b>, the digits along the arrow path must sum to the value in the circle at the base.
de: In einem <b>Pfeil-Sudoku</b> müssen die Ziffern entlang des Pfeilpfads die Wert im Kreis an der Basis ergeben.

source: If the base has two cells, the <b>left or top cell is the tens digit</b> and <b>the right or bottom is the ones digit</b>.
de: Hat die Basis zwei Zellen, ist die <b>linke oder obere Zelle die Zehnerstelle</b> und die <b>rechte oder untere die Einerstelle</b>.

source: Chevrons point to the cell with the larger number.
de: Chevrons zeigen auf die Zelle mit der größeren Zahl.

source: In a <b>Chevron Sudoku</b>, each chevron points toward the cell with the <b>higher digit</b>.
de: In einem <b>Chevron-Sudoku</b> zeigt jeder Chevron auf die Zelle mit der <b>höheren Zahl</b>.

source: Region is empty
de: Region ist leer

source: There are regions that have no clones
de: Es gibt Regionen ohne Klone

source: Region Color (if not set, random color will be used)
de: Region-Farbe (wenn nicht gesetzt, wird eine zufällige Farbe verwendet)

source: The <b>clones</b> must follow these rules:
de: Die <b>Klone</b> müssen folgende Regeln erfüllen:

source: Can be any shape and anywhere.
de: Können jede Form haben und überall sein.

source: Can overlap with each other and the regular Sudoku grid.
de: Können sich überschneiden und mit dem normalen Sudoku-Gitter.

source: Clones must have the same numbers in the same positions.
de: Klone müssen dieselben Zahlen an denselben Positionen haben.

source: In a <b>Clone Sudoku</b> clones with the same shape must have <b>matching</b> numbers.
de: In einem <b>Clone Sudoku</b> müssen Klone mit gleicher Form <b>übereinstimmende</b> Zahlen haben.

source: Line Path
de: Linienpfad

source: Line Color
de: Linienfarbe

source: Sum along the line
de: Summe entlang der Linie

source: The values inside the cells that align with the line must sum up to the target sum.
de: Die Werte in den Zellen, die mit der Linie übereinstimmen, müssen die Zielsummme ergeben.

source: In <b>Custom Sum Sudoku</b> the numbers in cells crossed by a line must add up to the <b>target sum</b> shown on that line. Lines of the <b>same color</b> share the same target sum.
de: In <b>Custom Sum Sudoku</b> müssen die Zahlen in Zellen, die von einer Linie geschnitten werden, zur <b>Zielsummme</b> auf der Linie addiert werden. Linien der <b>gleichen Farbe</b> haben dieselbe Zielsummme.

source: Diagonal
de: Diagonale

source: Diagonal Sum
de: Diagonalsumme

source: In a Diagonal Sum constraint, the digits along a specific diagonal must add up to a specified total.
de: Bei einer Diagonal-Summen-Beschränkung müssen die Ziffern entlang einer bestimmten Diagonale eine vorgegebene Summe ergeben.

source: Diagonals can be in either the ↘︎ or ↙︎ direction.
de: Diagonalen können in ↘︎ oder ↙︎ Richtung verlaufen.

source: In a <b>Diagonal Sum</b> puzzle, the marked diagonal must sum to the given total.
de: In einem <b>Diagonal Sum</b>-Rätsel muss die markierte Diagonale die angegebene Summe ergeben.

source: Main Diagonal (<i class="bi bi-arrow-up-left"></i>)
de: Hauptdiagonale (<i class="bi bi-arrow-up-left"></i>)

source: Anti-Diagonal (<i class="bi bi-arrow-up-right"></i>)
de: Gegendiagonale (<i class="bi bi-arrow-up-right"></i>)

source: In <b>Diagonal Sudoku</b>, digits 1 to 9 must also appear exactly once on one or both diagonals.
de: In <b>Diagonal Sudoku</b> müssen die Ziffern 1 bis 9 auch genau einmal auf einer oder beiden Diagonalen erscheinen.

source: Main Diagonal
de: Hauptdiagonale

source: From top-left to bottom-right.
de: Von oben links nach unten rechts.

source: Anti-Diagonal
de: Gegendiagonale

source: From top-right to bottom-left.
de: Von oben rechts nach unten links.

source: You can enable or disable each diagonal individually.
de: Sie können jede Diagonale einzeln aktivieren oder deaktivieren.

source: In a <b>Diagonal Sudoku</b>, digits 1 to 9 must appear exactly once on both diagonals.
de: In einem <b>Diagonal Sudoku</b> müssen die Ziffern 1 bis 9 genau einmal auf beiden Diagonalen erscheinen.

source: In a <b>Diagonal Sudoku</b>, digits 1 to 9 must appear exactly once on the <b>main diagonal</b> (top-left to bottom-right).
de: In einem <b>Diagonal Sudoku</b> müssen die Ziffern 1 bis 9 genau einmal auf der <b>Hauptdiagonale</b> (oben links nach unten rechts) erscheinen.

source: In a <b>Diagonal Sudoku</b>, digits 1 to 9 must appear exactly once on the <b>anti-diagonal</b> (top-right to bottom-left).
de: In einem <b>Diagonal Sudoku</b> müssen die Ziffern 1 bis 9 genau einmal auf der <b>Gegendiagonale</b> (oben rechts nach unten links) erscheinen.

source: In a <b>Diagonal Sudoku</b>, diagonal constraints are disabled.
de: In einem <b>Diagonal Sudoku</b> sind die Diagonal-Einschränkungen deaktiviert.

source: In <b>Dutch-Flat Sudoku</b>, each 5 must have a 1 directly above it and/or a 9 directly below it.
de: In <b>Dutch-Flat Sudoku</b> muss jede 5 eine 1 direkt darüber und/oder eine 9 direkt darunter haben.

source: Region must have 2 to 9 cells
de: Region muss 2 bis 9 Zellen enthalten

source: Regions must follow these rules:
de: Regionen müssen folgende Regeln erfüllen:

source: Must contain all numbers from 1 to 9 exactly once.
de: Müssen alle Zahlen von 1 bis 9 genau einmal enthalten.

source: Have between 2 and 9 cells.
de: Haben zwischen 2 und 9 Zellen.

source: Can overlap with each other.
de: Können sich überschneiden.

source: In <b>Extra-Regions</b> the regions must contain <b>all numbers</b> from 1 to 9 exactly <b>once</b>.
de: In <b>Extra-Regions</b> müssen die Regionen <b>alle Zahlen</b> von 1 bis 9 genau <b>einmal</b> enthalten.

source: Regions are empty
de: Regionen sind leer

source: Regions must have exactly 9 cells
de: Regionen müssen genau 9 Zellen enthalten

source: Irregular regions must follow these rules:
de: Unregelmäßige Regionen müssen folgende Regeln erfüllen:

source: Must have exactly 9 cells.
de: Müssen genau 9 Zellen enthalten.

source: Cannot overlap with each other.
de: Dürfen sich nicht überschneiden.

source: In <b>Irregular Region Sudoku</b> standard Sudoku rules apply. Additionally, the grid is divided into irregularly shaped regions instead of standard 3x3 boxes. Each of these irregular regions must also contain all digits from 1 to 9 exactly once.
de: Im <b>Irregular Region Sudoku</b> gelten die Standard-Sudoku-Regeln. Zusätzlich ist das Gitter in unregelmäßig geformte Regionen anstelle der Standard 3x3-Blöcke unterteilt. Jede dieser unregelmäßigen Regionen muss ebenfalls alle Ziffern von 1 bis 9 genau einmal enthalten.

source: Cage region is empty
de: Käfigbereich ist leer

source: Cage sum is too large
de: Käfigsumme ist zu groß

source: Cage sum is too small
de: Käfigsumme ist zu klein

source: Cage sum is not a number
de: Käfigsumme ist keine Zahl

source: Cage sum is not an integer
de: Käfigsumme ist keine ganze Zahl

source: Cage sum is not a positive number
de: Käfigsumme ist keine positive Zahl

source: Cage has more than 1 region
de: Käfig enthält mehr als eine Region

source: Numbers can repeat within a cage
de: Zahlen dürfen sich innerhalb eines Käfigs wiederholen

source: Cage Region
de: Käfigbereich

source: Cage Sum
de: Käfigsumme

source: Inside <b>cages</b>, the sum of the numbers must equal the specified value in the top left corner of the cage.
de: Innerhalb der <b>Käfige</b> muss die Summe der Zahlen dem angegebenen Wert in der oberen linken Ecke des Käfigs entsprechen.

source: In a <b>Killer Sudoku</b>, digits inside a cage must sum to the value shown in the top-left corner of the cage.
de: In einem <b>Killer Sudoku</b> müssen die Ziffern innerhalb eines Käfigs die Summe in der oberen linken Ecke des Käfigs ergeben.

source: In this puzzle, <b>digits may repeat</b> within a cage if they appear in different cells.
de: In diesem Rätsel dürfen sich <b>Ziffern innerhalb eines Käfigs wiederholen</b>, wenn sie in verschiedenen Zellen stehen.

source: Digits <b>must not repeat</b> within a cage.
de: Ziffern <b>dürfen sich nicht wiederholen</b> innerhalb eines Käfigs.

source: All dots given
de: Alle Punkte angegeben

source: Kropki Dot Edges
de: Kropki-Punkt-Kanten

source: A <b>white dot</b> between two cells means the numbers are consecutive (for example, 3 and 4).
de: Ein <b>weißer Punkt</b> zwischen zwei Zellen bedeutet, dass die Zahlen aufeinanderfolgend sind (z. B. 3 und 4).

source: A <b>black dot</b> means one number is exactly double the other (for example, 2 and 4).
de: Ein <b>schwarzer Punkt</b> bedeutet, dass eine Zahl genau doppelt so groß ist wie die andere (z. B. 2 und 4).

source: If the option <b>All Dots Given</b> is enabled, then every adjacent pair of cells that satisfies one of these conditions will have a dot.
de: Ist die Option <b>Alle Punkte angegeben</b> aktiviert, hat jedes benachbarte Paar von Zellen, das eine dieser Bedingungen erfüllt, einen Punkt.

source: This means that if there is no dot between two adjacent cells, then neither condition (consecutive nor double) applies.
de: Das bedeutet, dass wenn kein Punkt zwischen zwei benachbarten Zellen ist, dann gilt keine der beiden Bedingungen (aufeinanderfolgend oder doppelt).

source: If <b>All Dots Given</b> is not enabled, dots may only be placed selectively, and missing dots do not imply anything.
de: Ist <b>Alle Punkte angegeben</b> nicht aktiviert, können Punkte nur selektiv gesetzt werden, und fehlende Punkte bedeuten nichts.

source: In a <b>Kropki Sudoku</b>, a <b>white dot</b> means two digits are consecutive, and a <b>black dot</b> means one digit is double the other.
de: In einem <b>Kropki Sudoku</b> bedeutet ein <b>weißer Punkt</b>, dass zwei Ziffern aufeinanderfolgend sind, und ein <b>schwarzer Punkt</b>, dass eine Ziffer doppelt so groß ist wie die andere.

source: All valid pairs are marked, so if there's no dot between two adjacent cells, neither condition applies.
de: Alle gültigen Paare sind markiert, sodass wenn kein Punkt zwischen zwei benachbarten Zellen ist, keine der Bedingungen zutrifft.

source: Only some dots are given; the absence of a dot does not imply anything.
de: Nur einige Punkte sind angegeben; das Fehlen eines Punktes bedeutet nichts.

source: Magic Square (3×3)
de: Magisches Quadrat (3×3)

source: In a <b>Magic Square Sudoku</b>, every <b>gray 3×3 square</b> must have all its rows, columns, and diagonals sum to the same total.
de: In einem <b>Magic Square Sudoku</b> muss jedes <b>graue 3×3 Quadrat</b> in allen Reihen, Spalten und Diagonalen dieselbe Summe haben.

source: Base cells must be a 3×3 square.
de: Basiszellen müssen ein 3×3-Quadrat bilden.

source: In a <b>Magic Square</b>, the <b>rows, columns and diagonals</b> in the 3×3 square must sum to the same value.
de: In einem <b>Magic Square</b> müssen die <b>Reihen, Spalten und Diagonalen</b> im 3×3-Quadrat die gleiche Summe ergeben.

source: Arrow Direction
de: Pfeilrichtung

source: Target Digit
de: Zielziffer

source: In <b>Numbered-Rooms</b>, a clue is placed outside the grid and applies to a specific row or column. The <b>first digit</b> in the indicated direction determines a position N, and the <b>Nth cell</b> in that direction must contain the given clue digit.<br><br> For example, if the outside clue shows a 4 and the first digit in the direction is a 3, then the <b>3rd cell</b> must be a 4.
de: In <b>Numbered-Rooms</b> wird ein Hinweis außerhalb des Gitters platziert und gilt für eine bestimmte Reihe oder Spalte. Die <b>erste Ziffer</b> in der angegebenen Richtung bestimmt eine Position N, und die <b>N-te Zelle</b> in dieser Richtung muss die angegebene Ziffer enthalten.<br><br> Zum Beispiel: Wenn der Außenhinweis eine 4 zeigt und die erste Ziffer in der Richtung eine 3 ist, muss die <b>3. Zelle</b> eine 4 sein.

source: A clue digit is placed outside the grid for a row or column. The <b>first digit</b> seen from that side determines a position N, and the <b>Nth cell</b> must contain the clue digit.
de: Eine Hinweisziffer wird außerhalb des Gitters für eine Reihe oder Spalte platziert. Die <b>erste Ziffer</b>, die von dieser Seite aus gesehen wird, bestimmt eine Position N, und die <b>N-te Zelle</b> muss die Hinweisziffer enthalten.

source: Palindrome Path
de: Palindrom-Pfad

source: Along a <b>palindrome line</b>, the digits must read the same forward and backward.
de: Entlang einer <b>Palindrom-Linie</b> müssen die Ziffern vorwärts und rückwärts gleich gelesen werden.

source: In a <b>Palindrome Sudoku</b>, digits along each <b>blue palindrome line</b> must read the same forward and backward.
de: In einem <b>Palindrome Sudoku</b> müssen die Ziffern entlang jeder <b>blauen Palindrom-Linie</b> vorwärts und rückwärts gleich sein.

source: Parity Line Path
de: Paritätslinien-Pfad

source: Along a <b>parity line</b>, adjacent cells must have different parity (one odd, one even).
de: Entlang einer <b>Paritätslinie</b> müssen benachbarte Zellen unterschiedliche Parität haben (eine ungerade, eine gerade).

source: In a <b>Parity Sudoku</b>, adjacent digits along each <b>green parity line</b> must alternate between odd and even.
de: In einem <b>Parity Sudoku</b> müssen benachbarte Ziffern entlang jeder <b>grünen Paritätslinie</b> abwechselnd ungerade und gerade sein.

source: Renban Path
de: Renban-Pfad

source: Along a <b>renban line</b>, the digits form a consecutive sequence, in any order.
de: Entlang einer <b>Renban-Linie</b> bilden die Ziffern eine aufeinanderfolgende Sequenz, in beliebiger Reihenfolge.

source: In a <b>Renban Sudoku</b>, the digits on each <b>purple renban line</b> must form a consecutive set, in any order.
de: In einem <b>Renban Sudoku</b> müssen die Ziffern auf jeder <b>lila Renban-Linie</b> eine aufeinanderfolgende Menge bilden, in beliebiger Reihenfolge.

source: Row/Column
de: Reihe/Spalte

source: Sandwich Sum
de: Sandwich-Summe

source: In a Sandwich Sudoku, the sum of the numbers between 1 and 9 (the "bread") in a given row or column must match the given total. Cells outside the sandwich or part of the "bread" itself do not count toward the sum.
de: In einem Sandwich Sudoku muss die Summe der Zahlen zwischen 1 und 9 (dem „Brot“) in einer bestimmten Reihe oder Spalte der angegebenen Gesamtsumme entsprechen. Zellen außerhalb des Sandwichs oder die „Brot“-Zellen selbst zählen nicht zur Summe.

source: In a <b>Sandwich Sudoku</b>, the digits between <b>1</b> and <b>9</b> in a marked row or column must sum to the given total. The <b>1</b> and <b>9</b> act as the ends of the sandwich and are not included in the sum.
de: In einem <b>Sandwich Sudoku</b> müssen die Ziffern zwischen <b>1</b> und <b>9</b> in einer markierten Reihe oder Spalte die angegebene Summe ergeben. Die <b>1</b> und <b>9</b> bilden die Enden des Sandwichs und sind nicht in der Summe enthalten.

source: In <b>Standard Sudoku</b>, each row, each column, and each 3×3 block must contain the numbers <b>1</b> to <b>9</b> exactly once, without repetition.
de: Im <b>Standard Sudoku</b> müssen jede Reihe, jede Spalte und jeder 3×3-Block die Zahlen <b>1</b> bis <b>9</b> genau einmal ohne Wiederholung enthalten.

source: In a <b>Standard Sudoku</b>, every row, column, and 3×3 box must contain the digits <b>1</b> to <b>9</b> exactly once.
de: In einem <b>Standard Sudoku</b> muss jede Reihe, Spalte und 3×3-Box die Ziffern <b>1</b> bis <b>9</b> genau einmal enthalten.

source: Thermometer Path
de: Thermometer-Pfad

source: Along a <b>thermometer</b>, digits must increase from the bulb to the tip.
de: Entlang eines <b>Thermometers</b> müssen die Ziffern von der Birne zur Spitze zunehmen.

source: In a <b>Thermometer Sudoku</b>, digits must <b>strictly increase</b> along each <b>gray thermometer</b> from the bulb to the tip.
de: In einem <b>Thermometer Sudoku</b> müssen die Ziffern entlang jedes <b>grauen Thermometers</b> von der Birne bis zur Spitze <b>streng ansteigen</b>.

source: Whisper Line Path
de: Flüsterlinien-Pfad

source: Along a <b>whisper line</b>, adjacent digits must differ by at least 5.
de: Entlang einer <b>Flüsterlinie</b> müssen benachbarte Ziffern sich um mindestens 5 unterscheiden.

source: In a <b>Whisper Sudoku</b>, adjacent digits on each <b>teal whisper line</b> must differ by at least <b>5</b>.
de: In einem <b>Whisper Sudoku</b> müssen benachbarte Ziffern auf jeder <b>blauen Flüsterlinie</b> sich um mindestens <b>5</b> unterscheiden.

source: Wild Apple Symbol
de: Wildapfel-Symbol

source: <p>Digits separated by a red dot are non-consecutive and contain one even digit and one odd digit. All dots are given!</p>
de: <p>Ziffern, die durch einen roten Punkt getrennt sind, sind nicht aufeinanderfolgend und enthalten eine gerade und eine ungerade Ziffer. Alle Punkte sind angegeben!</p>

source: Digits separated by a <b>red dot</b> are <b>non-consecutive</b> and contain one <b>even digit</b> and one <b>odd digit</b>. All dots are given!
de: Ziffern, die durch einen <b>roten Punkt</b> getrennt sind, sind <b>nicht aufeinanderfolgend</b> und enthalten eine <b>gerade Ziffer</b> und eine <b>ungerade Ziffer</b>. Alle Punkte sind angegeben!

source: X Rule
de: X-Regel

source: V Rule
de: V-Regel

source: All symbols given
de: Alle Symbole angegeben

source: XV Symbol Edges
de: XV-Symbol-Kanten

source: <ul> <li><b>X</b>: The two cells sum to <b>10</b>.</li> <li><b>V</b>: The two cells sum to <b>5</b>.</li> </ul> If the option <b>All Symbols Given</b> is enabled, every adjacent pair that sums to 5 or 10 must have a corresponding symbol. If <b>All Symbols Given</b> is not enabled, symbols may only appear selectively, and missing symbols do not necessarily imply anything.
de: <ul> <li><b>X</b>: Die beiden Zellen ergeben zusammen <b>10</b>.</li> <li><b>V</b>: Die beiden Zellen ergeben zusammen <b>5</b>.</li> </ul> Wenn die Option <b>Alle Symbole angegeben</b> aktiviert ist, muss jedes benachbarte Paar, das 5 oder 10 ergibt, ein entsprechendes Symbol haben. Wenn <b>Alle Symbole angegeben</b> nicht aktiviert ist, können Symbole nur selektiv erscheinen, und fehlende Symbole bedeuten nicht unbedingt etwas.

source: In an <b>XV Sudoku</b>, an <b>X</b> between two cells means they sum to <b>10</b>, and a <b>V</b> means they sum to <b>5</b>.
de: In einem <b>XV Sudoku</b> bedeutet ein <b>X</b> zwischen zwei Zellen, dass sie zusammen <b>10</b> ergeben, und ein <b>V</b> bedeutet, dass sie zusammen <b>5</b> ergeben.

source: All valid X and V pairs are shown — if there's no symbol, the sum is neither 5 nor 10.
de: Alle gültigen X- und V-Paare werden angezeigt — wenn kein Symbol vorhanden ist, ist die Summe weder 5 noch 10.

source: Symbols may be placed selectively — a missing symbol does not imply anything.
de: Symbole können selektiv gesetzt werden — ein fehlendes Symbol bedeutet nichts.
